## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # module.alb.aws_lb_listener.https[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lb_listener" "https" {
      [32m+[0m[0m arn                                                                   = (known after apply)
      [32m+[0m[0m certificate_arn                                                       = "arn:aws:acm:us-east-1:901876312125:certificate/67c975ad-592c-4a90-bb4b-21699e08ad15"
      [32m+[0m[0m id                                                                    = (known after apply)
      [32m+[0m[0m load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:us-east-1:901876312125:loadbalancer/app/ecs-webapp-alb/73fe5d36340523da"
      [32m+[0m[0m port                                                                  = 443
      [32m+[0m[0m protocol                                                              = "HTTPS"
      [32m+[0m[0m routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      [32m+[0m[0m routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      [32m+[0m[0m routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      [32m+[0m[0m routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      [32m+[0m[0m routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      [32m+[0m[0m routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      [32m+[0m[0m routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      [32m+[0m[0m routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      [32m+[0m[0m routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      [32m+[0m[0m routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      [32m+[0m[0m routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      [32m+[0m[0m routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      [32m+[0m[0m routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      [32m+[0m[0m routing_http_response_access_control_max_age_header_value             = (known after apply)
      [32m+[0m[0m routing_http_response_content_security_policy_header_value            = (known after apply)
      [32m+[0m[0m routing_http_response_server_enabled                                  = (known after apply)
      [32m+[0m[0m routing_http_response_strict_transport_security_header_value          = (known after apply)
      [32m+[0m[0m routing_http_response_x_content_type_options_header_value             = (known after apply)
      [32m+[0m[0m routing_http_response_x_frame_options_header_value                    = (known after apply)
      [32m+[0m[0m ssl_policy                                                            = "ELBSecurityPolicy-TLS-1-2-2017-01"
      [32m+[0m[0m tags_all                                                              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Project"     = "sohaib-portfolio"
        }
      [32m+[0m[0m tcp_idle_timeout_seconds                                              = (known after apply)

      [32m+[0m[0m default_action {
          [32m+[0m[0m order            = (known after apply)
          [32m+[0m[0m target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:901876312125:targetgroup/ecs-webapp-tg/1da2181a31587e80"
          [32m+[0m[0m type             = "forward"
        }

      [32m+[0m[0m mutual_authentication (known after apply)
    }

[1m  # module.ecs.aws_appautoscaling_policy.ecs_policy_cpu[0m will be created
[0m  [32m+[0m[0m resource "aws_appautoscaling_policy" "ecs_policy_cpu" {
      [32m+[0m[0m alarm_arns         = (known after apply)
      [32m+[0m[0m arn                = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m name               = "sohaib-portfolio-cpu-scaling"
      [32m+[0m[0m policy_type        = "TargetTrackingScaling"
      [32m+[0m[0m resource_id        = "service/ecs-webapp-cluster/sohaib-portfolio"
      [32m+[0m[0m scalable_dimension = "ecs:service:DesiredCount"
      [32m+[0m[0m service_namespace  = "ecs"

      [32m+[0m[0m target_tracking_scaling_policy_configuration {
          [32m+[0m[0m disable_scale_in = false
          [32m+[0m[0m target_value     = 70

          [32m+[0m[0m predefined_metric_specification {
              [32m+[0m[0m predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

[1m  # module.ecs.aws_appautoscaling_policy.ecs_policy_memory[0m will be created
[0m  [32m+[0m[0m resource "aws_appautoscaling_policy" "ecs_policy_memory" {
      [32m+[0m[0m alarm_arns         = (known after apply)
      [32m+[0m[0m arn                = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m name               = "sohaib-portfolio-memory-scaling"
      [32m+[0m[0m policy_type        = "TargetTrackingScaling"
      [32m+[0m[0m resource_id        = "service/ecs-webapp-cluster/sohaib-portfolio"
      [32m+[0m[0m scalable_dimension = "ecs:service:DesiredCount"
      [32m+[0m[0m service_namespace  = "ecs"

      [32m+[0m[0m target_tracking_scaling_policy_configuration {
          [32m+[0m[0m disable_scale_in = false
          [32m+[0m[0m target_value     = 80

          [32m+[0m[0m predefined_metric_specification {
              [32m+[0m[0m predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

[1m  # module.ecs.aws_appautoscaling_target.ecs_target[0m will be created
[0m  [32m+[0m[0m resource "aws_appautoscaling_target" "ecs_target" {
      [32m+[0m[0m arn                = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m max_capacity       = 10
      [32m+[0m[0m min_capacity       = 1
      [32m+[0m[0m resource_id        = "service/ecs-webapp-cluster/sohaib-portfolio"
      [32m+[0m[0m role_arn           = (known after apply)
      [32m+[0m[0m scalable_dimension = "ecs:service:DesiredCount"
      [32m+[0m[0m service_namespace  = "ecs"
      [32m+[0m[0m tags_all           = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Project"     = "sohaib-portfolio"
        }

      [32m+[0m[0m suspended_state (known after apply)
    }

[1m  # module.ecs.aws_ecs_service.main[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_service" "main" {
      [32m+[0m[0m availability_zone_rebalancing      = "DISABLED"
      [32m+[0m[0m cluster                            = "arn:aws:ecs:us-east-1:901876312125:cluster/ecs-webapp-cluster"
      [32m+[0m[0m deployment_maximum_percent         = 200
      [32m+[0m[0m deployment_minimum_healthy_percent = 100
      [32m+[0m[0m desired_count                      = 2
      [32m+[0m[0m enable_ecs_managed_tags            = false
      [32m+[0m[0m enable_execute_command             = false
      [32m+[0m[0m iam_role                           = (known after apply)
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m launch_type                        = "FARGATE"
      [32m+[0m[0m name                               = "sohaib-portfolio"
      [32m+[0m[0m platform_version                   = (known after apply)
      [32m+[0m[0m scheduling_strategy                = "REPLICA"
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "Name" = "sohaib-portfolio-service"
        }
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Name"        = "sohaib-portfolio-service"
          [32m+[0m[0m "Project"     = "sohaib-portfolio"
        }
      [32m+[0m[0m task_definition                    = (known after apply)
      [32m+[0m[0m triggers                           = (known after apply)
      [32m+[0m[0m wait_for_steady_state              = false

      [32m+[0m[0m load_balancer {
          [32m+[0m[0m container_name   = "sohaib-portfolio"
          [32m+[0m[0m container_port   = 5000
          [32m+[0m[0m target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:901876312125:targetgroup/ecs-webapp-tg/1da2181a31587e80"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [32m+[0m[0m network_configuration {
          [32m+[0m[0m assign_public_ip = false
          [32m+[0m[0m security_groups  = [
              [32m+[0m[0m "sg-0aa0e93068d8d3b67",
            ]
          [32m+[0m[0m subnets          = [
              [32m+[0m[0m "subnet-03467c78fb2f7b334",
              [32m+[0m[0m "subnet-0534cfe9c508b7c58",
            ]
        }
    }

[1m  # module.ecs.aws_ecs_task_definition.main[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_ecs_task_definition" "main" {
      [33m~[0m[0m arn                      = "arn:aws:ecs:us-east-1:901876312125:task-definition/sohaib-portfolio:4" -> (known after apply)
      [33m~[0m[0m arn_without_revision     = "arn:aws:ecs:us-east-1:901876312125:task-definition/sohaib-portfolio" -> (known after apply)
      [33m~[0m[0m container_definitions    = jsonencode(
          [33m~[0m[0m [
              [33m~[0m[0m {
                  [33m~[0m[0m image            = "901876312125.dkr.ecr.us-east-1.amazonaws.com/sohaibsohail/sohaib-portfolio@sha256:b00db38c3b0c319117e71a01018d94e80ff35d73830922777d129df083246c6b" [33m->[0m[0m "901876312125.dkr.ecr.us-east-1.amazonaws.com/sohaibsohail/sohaib-portfolio@sha256:5927b4375900a834f2ec455ded9ccbb450ddc2634b8cd43720fbf30b627b34c0"
                  [31m-[0m[0m mountPoints      = []
                    name             = "sohaib-portfolio"
                  [33m~[0m[0m portMappings     = [
                      [33m~[0m[0m {
                          [31m-[0m[0m hostPort      = 5000
                            [90m# (2 unchanged attributes hidden)[0m[0m
                        },
                    ]
                  [31m-[0m[0m systemControls   = []
                  [31m-[0m[0m volumesFrom      = []
                    [90m# (4 unchanged attributes hidden)[0m[0m
                },
            ] [31m# forces replacement[0m[0m
        )
      [33m~[0m[0m enable_fault_injection   = false -> (known after apply)
      [33m~[0m[0m id                       = "sohaib-portfolio" -> (known after apply)
      [33m~[0m[0m revision                 = 4 -> (known after apply)
        tags                     = {
            "Name" = "sohaib-portfolio-task-definition"
        }
        [90m# (12 unchanged attributes hidden)[0m[0m
    }

[1m  # module.route53.aws_acm_certificate_validation.main[0][0m will be created
[0m  [32m+[0m[0m resource "aws_acm_certificate_validation" "main" {
      [32m+[0m[0m certificate_arn         = "arn:aws:acm:us-east-1:901876312125:certificate/67c975ad-592c-4a90-bb4b-21699e08ad15"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m validation_record_fqdns = (known after apply)

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "10m"
        }
    }

[1m  # module.route53.aws_route53_record.cert_validation["portfolio.sohaibsohail.co.uk"][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "cert_validation" {
      [32m+[0m[0m allow_overwrite = true
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "_35b70c30d97a0f34418995035c03bbc6.portfolio.sohaibsohail.co.uk"
      [32m+[0m[0m records         = [
          [32m+[0m[0m "_f4df8b2c523223f0c2fe1b6b78c265a7.xlfgrmvvlj.acm-validations.aws.",
        ]
      [32m+[0m[0m ttl             = 60
      [32m+[0m[0m type            = "CNAME"
      [32m+[0m[0m zone_id         = (known after apply)
    }

[1m  # module.route53.aws_route53_record.main[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "main" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "portfolio.sohaibsohail.co.uk"
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = (known after apply)

      [32m+[0m[0m alias {
          [32m+[0m[0m evaluate_target_health = true
          [32m+[0m[0m name                   = "ecs-webapp-alb-1391415547.us-east-1.elb.amazonaws.com"
          [32m+[0m[0m zone_id                = "Z35SXDOTRQ7X7K"
        }
    }

[1m  # module.route53.aws_route53_zone.main[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_zone" "main" {
      [32m+[0m[0m arn                 = (known after apply)
      [32m+[0m[0m comment             = "Managed by Terraform"
      [32m+[0m[0m force_destroy       = false
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "sohaibsohail.co.uk"
      [32m+[0m[0m name_servers        = (known after apply)
      [32m+[0m[0m primary_name_server = (known after apply)
      [32m+[0m[0m tags_all            = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Project"     = "sohaib-portfolio"
        }
      [32m+[0m[0m zone_id             = (known after apply)
    }

[1mPlan:[0m 10 to add, 0 to change, 1 to destroy.
[0m
```
</details>